<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Adobe Reader.
Set MAJOR_VERSION to "10" to get the latest/last version of Adobe Reader 10 instead of 11.
        </string>
        <key>Identifier</key>
        <string>com.github.dmitriychemikos.autopkgs.download.AdobeReader</string>
        <key>Input</key>
        <dict>
            <key>LANGUAGE</key>
            <string>English</string>
            <key>MAJOR_VERSION</key>
            <string>11</string>
            <key>OS_VERSION</key>
            <string>10.8.0</string>
            <key>NAME</key>
            <string>AdobeReader</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>language</key>
                    <string>%LANGUAGE%</string>
                    <key>major_version</key>
                    <string>%MAJOR_VERSION%</string>
                    <key>os_version</key>
                    <string>%OS_VERSION%</string>
                </dict>
                <key>Processor</key>
                <string>AdobeReaderURLProvider</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/*.pkg</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Adobe Systems, Inc. (JQ525L2MZD)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
